




import '../models/User_model.dart';

List<User> UserData = [
  User(id: 1, description: """Посконкин Александр Романович родился 7 января 1919 года в селе Коптево Рассказовского района. Учился и работал в рабочем посёлке «Красный боевик» (г. Котовск).

В Красную Армию был призван в 1939 году. Участвовал в белофинской войне (1939-1940 гг.) в составе особого лыжного отряда моряков Балтийского флота, выполняя ответственные задания по разведке.

В одном рукопашном бою уничтожил несколько противников, спас командира и доставил ценные сведения об обороне противника. За мужество и отвагу, проявленные в ходе боевых операций, А.Р. Посконкину 21 апреля 1940 года было присвоено звание Героя Советского Союза с вручением ордена Ленина и медали «Золотая Звезда» - первому из рядовых бойцов Красной Армии.

Отважно воевал наш земляк и на фронтах Великой Отечественной войны: защищал Ленинград, освобождал Украину, Западную Европу.

Александра Посконкина, чья гармонь хранится в коллекции музея, после 1942 года назначили помощником командира батареи на одном из кронштадтских фортов, которые были огневым щитом Ленинграда. Их орудия защищали подступы к городу и Неве во время обороны и позже - во время блокады.

О храбрости и мужестве свидетельствуют его боевые награды: орден Отечественной войны II степени, два ордена Красной Звезды и другие ордена и медали.

В 1956 году майор Посконкин вернулся в г. Котовск, работал на заводах «Пластмасс», «Алмаз». Среди горожан пользовался большим авторитетом, часто выступал перед молодёжью с рассказами о своей фронтовой жизни, о товарищах по оружию. Его именем названа одна из улиц нашего города.

Александр Твардовский несколько раз встречался с
Посконкиным. Именно его подвиг лег в основу главы «О герое» в поэме «Василий Теркин»:


Аж привстал герой,
- Ну что вы, 
Что вы, - вскинул головой, - 
Я как раз из-под Тамбова, - 
И потрогал орден свой.""", img: "1", video:'assets/video/video.mp4'),
  User(id: 2, description: "description2", img: "2"),
  User(id: 3, description: "description3", img: "3"),
  User(id: 4, description: "description4", img: "4"),
  User(id: 5, description: "description5", img: "5"),
  User(id: 6, description: "description6", img: "6"),
  User(id: 7, description: "description7", img: "7"),
  User(id: 8, description: "description8", img: "8"),
  User(id: 9, description: "description9", img: "9"),

];