




import '../models/User_model.dart';

List<User> UserData = [
  User(id: 1, description: """Посконкин Александр Романович родился 7 января 1919 года в селе Коптево Рассказовского района. Учился и работал в рабочем посёлке «Красный боевик» (г. Котовск).

В Красную Армию был призван в 1939 году. Участвовал в белофинской войне (1939-1940 гг.) в составе особого лыжного отряда моряков Балтийского флота, выполняя ответственные задания по разведке.

В одном рукопашном бою уничтожил несколько противников, спас командира и доставил ценные сведения об обороне противника. За мужество и отвагу, проявленные в ходе боевых операций, А.Р. Посконкину 21 апреля 1940 года было присвоено звание Героя Советского Союза с вручением ордена Ленина и медали «Золотая Звезда» - первому из рядовых бойцов Красной Армии.

Отважно воевал наш земляк и на фронтах Великой Отечественной войны: защищал Ленинград, освобождал Украину, Западную Европу.

Александра Посконкина, чья гармонь хранится в коллекции музея, после 1942 года назначили помощником командира батареи на одном из кронштадтских фортов, которые были огневым щитом Ленинграда. Их орудия защищали подступы к городу и Неве во время обороны и позже - во время блокады.

О храбрости и мужестве свидетельствуют его боевые награды: орден Отечественной войны II степени, два ордена Красной Звезды и другие ордена и медали.

В 1956 году майор Посконкин вернулся в г. Котовск, работал на заводах «Пластмасс», «Алмаз». Среди горожан пользовался большим авторитетом, часто выступал перед молодёжью с рассказами о своей фронтовой жизни, о товарищах по оружию. Его именем названа одна из улиц нашего города.

Александр Твардовский несколько раз встречался с
Посконкиным. Именно его подвиг лег в основу главы «О герое» в поэме «Василий Теркин»:


Аж привстал герой,
- Ну что вы, 
Что вы, - вскинул головой, - 
Я как раз из-под Тамбова, - 
И потрогал орден свой.""", img: "1", video:'assets/video/video.mp4'),


  User(id: 2, description: """ Федоров Борис Алексеевич родился в 1915 году в г. Тамбове. Работал слесарем, а затем машинистом на электростанции посёлка «Красный боевик» (г. Котовск).

Призван в ряды Красной Армии Котовским военкоматом. Во время Великой Отечественной войны был командиром батальона гвардейской механизированной
бригады.

В боях под Шяуляем и Елгавой умело руководил батальоном, проявил личную отвагу и погиб. Звание Героя Советского Союза Федорову Борису Алексеевичу было присвоено посмертно 24 марта 1945 года.

Награждён орденами Суворова, Александра Невского, другими орденами и медалями. Одна из улиц г. Тамбова названа его именем. """, img: "2"),


  User(id: 3, description: """ Питерский Георгий Иванович родился в 1910 году в селе Чутановка Кирсановского района. По окончании школы пошел работать кочегаром, затем сменным машинистом на госмельницу в Кирсанове.

Через два года комсомольским активом был направлен на учебу в Тамбовскую совпартшколу. В начале тридцатых годов Питерский работал инструктором Воронежского облколхозсоюза, а затем - заведующим оргкомитета ВЛКСМ на котовском заводе № 204. Отсюда в 1932 году ушел на действительную службу в ряды Красной Армии.

В Великой Отечественной войне учавствовал с первых дней вражеского нашествия. Участвовал в составе 115-го гвардейского истребительного противотанкового артполка в боях под Сталинградом, на Курской дуге. Майор Питерский был заместителем командира полка.
В сентябре 1943 года полк вышел к Днепру.

Под сильным артиллерийско-минометным огнем Питерский руководил переправой. В начале октября фашисты потеснили наши части и захватили некоторые населенные пункты. Кольцо противника замкнулось вокруг 115-го артполка и 229-го стрелкового.

Майор Питерский и командир 229-го полка организовали прорыв кольца и вывели из окружения личный состав и технику.

Звание Героя Советского Союза было присвоено Питерскому Георгию Ивановичу 26 октября 1943 года. Он также награжден орденами Красного Знамени, """, img: "3"),


  User(id: 4, description: """ Имя Комбарова Егора Игнатьевича хорошо известно в нашем городе.

Родился он в 1910 году в селе Бахарево Сампурского района. Работал на заводе № 204 г. Котовска. В 1942 году добровольцем уходит на фронт. Участвовал в боях на Калининском, Брянском, Центральном и 1-м Украинском фронтах в составе 25-й гвардейской механизированной бригады.

В сентябре 1943 года наши войска подошли к Днепру. Сержанту Комбарову, командиру отделения, было приказано форсировать Днепр вместе с группой бойцов и закрепиться на противоположном берегу реки, подготовить плацдарм для наступления.

При выполнении боевого задания сержант Комбаров проявил мужество и героизм. Приказ командования был выполнен. Это было 26 сентября 1943 года. Погиб Егор Игнатьевич Комбаров 4 октября 1943 года в боях по расширению плацдарма для наступления наших войск. Звание Героя Советского Союза было ему присвоено 17 октября 1943 года посмертно. """, img: "4"),


  User(id: 5, description: """ Конин Михаил Федорович родился в 1921 году в селе Андреевке Сампурского района. Окончил семилетку и школу ФЗУ, затем работал в г. Котовске.

Одновременно учился в аэроклубе. В Красной Армии с 1940 года. Окончил военно-авиационное училище в г.Энгельсе. В Великой Отечественной войне участвовал с октября 1942 года в составе 93-го гвардейского штурмового авиационного полка на Юго-Западном и 3-м Украинском фронтах.

Лейтенант Конин совершил множество боевых вылетов, из них 120 были успешными.

За героизм летчику Конину Михаилу Федоровичу было присвоено звание Героя Советского Союза 2 августа 1944 года. Он также награжден двумя орденами Красного Знамени, Отечественной войны II степени, Александра Невского и медалями. """, img: "5"),

  User(id: 6, description: """ Свистунов Андрей Иванович родился в 1921 году в селе Никольское Знаменского района. Окончил семилетку, затем работал на заводе № 204 г. Котовска. Призван в ряды Красной Армии в 1940 году. Во время Великой Отечественной войны командовал отделением в 82-м саперном батальоне в звании старшего сержанта. В боях на подступах к реке Висле и при форсировании ее в августе 1944 года проявил беспримерный героизм. Во время танковой атаки врага в районе Голотнице-Дольно на виду у противника заминировал мост и сорвал атаку вражеский войск. За этот подвиг Свистунову Андрею Ивановичу было присвоено звание Героя Советского Союза 23 сентября 1944 года. Он также награжден орденами Красной Звезды, Славы III степени и медалями.     """, img: "6"),


  User(id: 7, description: """ Любичев Михаил Дмитриевич родился в 1910 году.

Слесарь завода № 204. Призван в ряды Красной Армии в 1941 году Котовским военкоматом. Воевал командиром взвода 154-го гвардейского стрелкового полка в звании лейтенанта. Героически сражался на разных фронтах.

В 1944 году при прорыве обороны врага под городом Великие Луки совершил беспримерный подвиг: первый со своим взводом ворвался на позиции врага и, сея панику и смерть в стане противника, продолжал наступление.

Погиб, отражая контратаки фашистов. Звание Героя Советского Союза присвоено Любичеву Михаилу Дмитриевичу посмертно 4 июля 1944 года.""", img: "7"),


  User(id: 8, description: """ Поляков Михаил Павлович родился в 1923 году. Родом их села Юматово Тамбовского района. Работал на заводе № 204 г. Котовска. В Красной Армии начал службу в 1942 году. В Великой Отечественной войне участвовал в составе 453-го стрелкового полка.

Был наводчиком расчета противотанкового ружья. Во время боев был дважды ранен. В сентябре 1943 года шли бои в районе города Запорожье. Бойцам вместе с Поляковым пришлось отражать атаки пехоты, танков, самоходных установок и бронемашин противника. В критический момент боя Поляков со связкой гранат бросился под вражеский танк.

Звание Героя Советского Союза Полякову Михаилу Павловичу было присвоено посмертно 19 марта 1944 года.""", img: "8"),


  User(id: 9, description: """ Малин Анатолий Петрович родился в 1916 году в Тамбове. Окончил школу ФЗУ №1 при поселке «Красный боевик» (г. Котовск), работал на заводе слесарем пятого производства. В 1934 году добровольно вступил в Красную Армию.

Четыре года спустя Малин закончил Саратовское бронетанковое училище и по комсомольскому призыву направлен в Чкаловскую школу летчиков.

Принимал участие в белофинской войне в качестве пилота дальней бомбардировочной авиации. Совершил восемь успешных вылетов.

С начала Великой Отечественной войны и до Победы Малин являлся штурманом 140-го авиаполка пикирующих бомбардировщиков ПЕ-2 1-й воздушной Армии на Западном, Сталинградском, Ленинградском, 3-м Белорусском фронтах. Совершил 182 вылета.

На счету его группы 10 сбитых истребителей, 14 самолетов противника уничтожено на земле, разрушено несколько заводов стратегического назначения, железнодорожных станций, узлов, водных причалов и переправ, судов, эшелонов с боевой техникой и живой силой противника и т.д.

Звание Героя Советского Союза Малину было присвоено 29 июня 1945 года. Он также награжден двумя орденами Красного Знамени, Александра Невского, Отечественной войны I степени, Красной Звезды и медалями. """, img: "9"),

];